---
kind: method
id: M:Autodesk.Revit.DB.Connector.GetMEPConnectorInfo
zh: 连接件、接口
source: html/fc07b9ff-9101-90d5-740d-0c19357c6919.htm
---
# Autodesk.Revit.DB.Connector.GetMEPConnectorInfo Method

**中文**: 连接件、接口

Gets MEP connector information.

## Syntax (C#)
```csharp
public MEPConnectorInfo GetMEPConnectorInfo()
```

## Returns
Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no MEP connector information associated.